MDK-Packs/CB_Lab4Layer/layer/Board/LPC54018-IoT-Module/RTE/Board_Support/LPC54018JET180/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/* Define the PIO[ANAMODE] bit macro (SDK 2.6.x and older miss this bit macro definition) */
#ifndef IOCON_PIO_ANAMODE_MASK
#define IOCON_PIO_ANAMODE_MASK  (0x40U)
#define IOCON_PIO_ANAMODE_SHIFT (6U)
#define IOCON_PIO_ANAMODE(x)    (((uint32_t)(((uint32_t)(x)) << IOCON_PIO_ANAMODE_SHIFT)) & IOCON_PIO_ANAMODE_MASK)
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO022_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 7. */
#define PIO022_FUNC_ALT7 0x07u
/*!
 * @brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO022_INVERT_DISABLED 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO022_MODE_INACTIVE 0x00u
/*!
 * @brief Controls open-drain mode.: Normal. Normal push-pull output */
#define PIO022_OD_NORMAL 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Standard mode, output slew rate control is enabled.
 * More outputs can be switched simultaneously.
 */
#define PIO022_SLEW_STANDARD 0x00u

/*! @name PIO0_22 (coord B12), J3[62]/P0_22-USB0_VBUS
  @{ */
#define BOARD_INITPINS_USB0_VBUS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USB0_VBUS_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USB0_VBUS_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#define PIO023_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_26 (coord M13), U20[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_SPIFI_CLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_CLK_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_CLK_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_24 (coord M7), U20[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_SPIFI_IO0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO0_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO0_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_25 (coord K8), U20[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_SPIFI_IO1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO1_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO1_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_27 (coord L9), U20[7]/P0_27-SPIFI_IO3
  @{ */
#define BOARD_SPIFI_IO3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO3_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO3_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_28 (coord M9), U20[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
#define BOARD_SPIFI_IO2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO2_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO2_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PIO0_23 (coord N7), U20[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
#define BOARD_SPIFI_CSn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_CSn_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_CSn_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                  /* @} */

