MDK-Packs/CB_Lab4Layer/layer/Board/LPC54018-IoT-Module/RTE/Board_Support/LPC54018JET180/pin_mux.h
/*! @name PIO1_16 (coord B7), J4[96]/P1_16-EMC_A10
  @{ */
#define BOARD_EMC_A10_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A10_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A10_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_27 (coord F10), J3[55]/P1_27-EMC_A9
  @{ */
#define BOARD_EMC_A9_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A9_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A9_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_26 (coord J10), J3[51]/P1_26-EMC_A8
  @{ */
#define BOARD_EMC_A8_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A8_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A8_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_8 (coord P8), J4[4]/P1_8-EMC_A7
  @{ */
#define BOARD_EMC_A7_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A7_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A7_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_7 (coord N1), J4[31]/P1_7-EMC_A6
  @{ */
#define BOARD_EMC_A6_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A6_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A6_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_6 (coord G4), J4[50]/P1_6-EMC_A5
  @{ */
#define BOARD_EMC_A5_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A5_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A5_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_5 (coord E4), J4[68]P1_5-EMC_A4
  @{ */
#define BOARD_EMC_A4_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A4_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A4_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_21 (coord C13), J3[54]P0_21-EMC_A3
  @{ */
#define BOARD_EMC_A3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A3_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A3_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_20 (coord D13), J3[50]/P0_20-EMC_A2
  @{ */
#define BOARD_EMC_A2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_19 (coord C6), J4[88]/P0_19-EMC_A1
  @{ */
#define BOARD_EMC_A1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_18 (coord C14), J3[52]/P0_18-EMC_A0
  @{ */
#define BOARD_EMC_A0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_A0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_EMC_A0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_15 (coord L4), J4[46]/P0_15-EMC_WEn
  @{ */
#define BOARD_EMC_WEn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_WEn_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_EMC_WEn_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_9 (coord K6), J4[12]/P1_9-EMC_CASn
  @{ */
#define BOARD_EMC_CASn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CASn_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_EMC_CASn_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_10 (coord N9), J3[5]/P1_10-EMC_RASn
  @{ */
#define BOARD_EMC_RASn_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_RASn_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_EMC_RASn_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_12 (coord K9), J3[7]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_EMC_DYCSn0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DYCSn0_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_EMC_DYCSn0_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO1_31 (coord C5), J4[84]/P1_31-EMC_D15
  @{ */
#define BOARD_EMC_D15_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D15_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D15_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_30 (coord A8), J3[92]/P1_30-EMC_D14
  @{ */
#define BOARD_EMC_D14_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D14_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D14_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_29 (coord C11), J3[85]/P1_29-EMC_D13
  @{ */
#define BOARD_EMC_D13_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D13_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D13_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_28 (coord E12), J3[77]/P1_28-EMC_D12
  @{ */
#define BOARD_EMC_D12_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D12_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D12_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_4 (coord D4), J4[74]/P1_4-EMC_D11
  @{ */
#define BOARD_EMC_D11_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D11_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D11_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

