MDK-Packs/CB_Lab4Layer/layer/Board/LPC54018-IoT-Module/RTE/Board_Support/LPC54018JET180/pin_mux.h
/*! @name PIO1_21 (coord N8), J4[6]/P1_21-EMC_D10
  @{ */
#define BOARD_EMC_D10_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D10_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D10_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_20 (coord M1), J4[33]/P1_20-EMC_D9
  @{ */
#define BOARD_EMC_D9_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D9_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D9_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO1_19 (coord L1), J4[35]/P1_19-EMC_D8
  @{ */
#define BOARD_EMC_D8_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D8_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D8_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_9 (coord G12), J3[57]/P0_9-EMC_D7
  @{ */
#define BOARD_EMC_D7_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D7_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D7_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_8 (coord H10), J3[36]/P0_8-EMC_D6
  @{ */
#define BOARD_EMC_D6_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D6_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D6_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_7 (coord H12), J3[49]P0_7-EMC_D5
  @{ */
#define BOARD_EMC_D5_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_6 (coord A5), J3[96]/P0_6-EMC_D4
  @{ */
#define BOARD_EMC_D4_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D4_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_5 (coord E7), J3[92]/P0_5-EMC_D3
  @{ */
#define BOARD_EMC_D3_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D3_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_4 (coord C8), J3[94]/P0_4-EMC_D2
  @{ */
#define BOARD_EMC_D2_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_3 (coord A10), J3[70]P0_3-ISP_FC3_MOSI-EMC_D1
  @{ */
#define BOARD_EMC_D1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_2 (coord E9), J3[97]/P0_2-ISP_FC3_MISO-EMC_D0
  @{ */
#define BOARD_EMC_D0_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_14 (coord C12), J3[83]/P1_14-EMC_DQM1
  @{ */
#define BOARD_EMC_DQM1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_EMC_DQM1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_13 (coord G10), J3[53]/P1_13-EMC_DQM0
  @{ */
#define BOARD_EMC_DQM0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM0_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_EMC_DQM0_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_11 (coord B4), J4[94]/P1_11-EMC_CLK0
  @{ */
#define BOARD_EMC_CLK0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CLK0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_EMC_CLK0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_15 (coord A11), J3[73]/P1_15-EMC_CKE0
  @{ */
#define BOARD_EMC_CKE0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CKE0_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_EMC_CKE0_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void); /* Function assigned for the Cortex-M4F */

#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO030_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO0_29 (coord B13), J4[97]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_ISP_FC0_RXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_RXD_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_RXD_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_30 (coord A2), J4[93]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_ISP_FC0_TXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_TXD_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_TXD_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

#define PIO010_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO010_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO011_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO012_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

