MDK-Packs/CB_Lab4Layer/layer/Board/LPC54018-IoT-Module/RTE/Board_Support/LPC54018JET180/pin_mux.h
/*! @name PIO0_12 (coord M3), J4[32]/J7[4]/IF_SWDIO
  @{ */
#define BOARD_IF_SWDIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_IF_SWDIO_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_IF_SWDIO_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_11 (coord L3), J4[34]/J7[4]/SWDCLK_TRGT
  @{ */
#define BOARD_SWDCLK_TRGT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SWDCLK_TRGT_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_SWDCLK_TRGT_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_10 (coord P2), J4[27]/J7[6]/SWO_TRGT
  @{ */
#define BOARD_SWO_TRGT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SWO_TRGT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_SWO_TRGT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M4F */

/*!
 * @brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO10_ANAMODE_DISABLED 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO10_FUNC_ALT0 0x00u
/*!
 * @brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO10_INVERT_DISABLED 0x00u
/*!
 * @brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO10_MODE_PULL_UP 0x02u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO122_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO122_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO315_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO315_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO316_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO316_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO317_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO317_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO33_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO33_FUNC_ALT0 0x00u
/*!
 * @brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO33_INVERT_DISABLED 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO33_MODE_PULL_DOWN 0x01u

/*! @name PIO3_15 (coord D2), J4[81]/P3_15-SD_WPn
  @{ */
#define BOARD_INITGT1216SHIELD_SPI8_SCK_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_SPI8_SCK_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_SPI8_SCK_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO3_17 (coord K1), J4[45]/P3_17-FC8_MISO
  @{ */
#define BOARD_INITGT1216SHIELD_SPI8_MISO_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_SPI8_MISO_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_SPI8_MISO_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO3_16 (coord E1), J4[73]/P3_16-GPIO_SPI_CS2
  @{ */
#define BOARD_INITGT1216SHIELD_SPI8_MOSI_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_SPI8_MOSI_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_SPI8_MOSI_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO1_22 (coord P11), IRQ
  @{ */
#define BOARD_INITGT1216SHIELD_SPI8_SSEL1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_SPI8_SSEL1_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_SPI8_SSEL1_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO3_3 (coord A13), PWRON
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGT1216SHIELD_PWRON_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGT1216SHIELD_PWRON_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITGT1216SHIELD_PWRON_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_PWRON_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_PWRON_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO1_0 (coord N3), IRQ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGT1216SHIELD_IRQ_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGT1216SHIELD_IRQ_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITGT1216SHIELD_IRQ_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGT1216SHIELD_IRQ_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITGT1216SHIELD_IRQ_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGT1216Shield(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
